swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
/**************************************************************************//**
 * @file     rtl8735b_eddsa.c
 * @brief    This file implements the EDDSA Secure and Non-secure HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2021-06-11
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_eddsa.h"
#include "rtl8735b_eddsa_type.h"
#include "rtl8735b_eddsa_ctrl.h"
#include "rtl8735b_syson_s_type.h"
#include "rtl8735b.h"

#if CONFIG_EDDSA_EN
/**
 * @addtogroup hs_hal_eddsa EDDSA
 * @{
 */

/// @cond DOXYGEN_ROM_HAL_API

/// @endcond
/** @} */ /* End of group hs_hal_eddsa */

//
//

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#undef EDDSA_MODULE
#define EDDSA_MODULE (EDDSA_NS_MODULE)

#undef EDDSA_REG_BASE
#define EDDSA_REG_BASE (EDDSA_NS_BASE)

#else

#undef EDDSA_MODULE
#define EDDSA_MODULE (EDDSA_S_MODULE)

#undef EDDSA_REG_BASE
#define EDDSA_REG_BASE (EDDSA_S_BASE)
#endif

#define SECTION_EDDSA_TEXT           SECTION(".rom.hal_eddsa.text")
#define SECTION_EDDSA_DATA           SECTION(".rom.hal_eddsa.data")
#define SECTION_EDDSA_RODATA         SECTION(".rom.hal_eddsa.rodata")
#define SECTION_EDDSA_BSS            SECTION(".rom.hal_eddsa.bss")
#define SECTION_EDDSA_STUBS          SECTION(".rom.hal_eddsa.stubs")

extern void dump_for_one_bytes(u8 *pdata, u32 len);

#undef __dbg_mem_dump
#define __dbg_mem_dump(enable, start, size, prefix) do{ \
    if(enable){ \
        DBG_EDDSA_INFO(prefix "\r\n");\
        dump_for_one_bytes ((u8 *)start, size);\
    }\
}while(0)


SECTION_EDDSA_STUBS
const hal_eddsa_func_stubs_t hal_eddsa_stubs = {
	.hal_eddsa_init   = hal_rtl_eddsa_init,
	.hal_eddsa_deinit = hal_rtl_eddsa_deinit,
	.hal_eddsa_sign_verify = hal_rtl_eddsa_sign_verify,
	.hal_eddsa_sign_verify_autoflow = hal_rtl_eddsa_sign_verify_autoflow,
	.hal_eddsa_sign_verify_semi_auto = hal_rtl_eddsa_sign_verify_semi_auto,
	.hal_eddsa_sign_verify_steps = hal_rtl_eddsa_sign_verify_steps,
	.hal_eddsa_get_enc_Rplus = hal_rtl_eddsa_get_enc_Rplus,
	.hal_eddsa_get_Rplus = hal_rtl_eddsa_get_Rplus,
	.hal_eddsa_get_kA = hal_rtl_eddsa_get_kA,
	.hal_eddsa_get_sB = hal_rtl_eddsa_get_sB,
	.hal_eddsa_get_recover_pbk = hal_rtl_eddsa_get_recover_pbk,
	.hal_eddsa_set_hash_digest = hal_rtl_eddsa_set_hash_digest,
	.hal_eddsa_set_recover_pbk = hal_rtl_eddsa_set_recover_pbk,
	.hal_eddsa_set_encode_pbk = hal_rtl_eddsa_set_encode_pbk,
	.hal_eddsa_set_signature_s = hal_rtl_eddsa_set_signature_s,
	.hal_eddsa_set_word_from_byte = hal_rtl_eddsa_set_word_from_byte,
	.hal_eddsa_get_byte_from_word = hal_rtl_eddsa_get_byte_from_word,
	.hal_eddsa_set_x1_in_val = hal_rtl_eddsa_set_x1_in_val,
	.hal_eddsa_set_y1_in_val = hal_rtl_eddsa_set_y1_in_val,
	.hal_eddsa_set_x2_in_val = hal_rtl_eddsa_set_x2_in_val,
	.hal_eddsa_set_y2_in_val = hal_rtl_eddsa_set_y2_in_val,
	.hal_eddsa_get_x1_out_val = hal_rtl_eddsa_get_x1_out_val,
	.hal_eddsa_get_y1_out_val = hal_rtl_eddsa_get_y1_out_val,
	.hal_eddsa_get_x2_out_val = hal_rtl_eddsa_get_x2_out_val,
	.hal_eddsa_get_y2_out_val = hal_rtl_eddsa_get_y2_out_val,
	.hal_eddsa_verify_32 = hal_rtl_eddsa_verify_32,
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
	.hal_eddsa_sign_verify_core = hal_rtl_eddsa_sign_verify_core,
	.hal_eddsa_hook_hash_op_f = hal_rtl_eddsa_hook_hash_op_f,
	.hal_eddsa_hash_init_hook = hal_rtl_eddsa_hash_init_hook,
	.hal_eddsa_hash_update_hook = hal_rtl_eddsa_hash_update_hook,
	.hal_eddsa_hash_final_hook = hal_rtl_eddsa_hash_final_hook,
	.hal_eddsa_hook_sign_vrf_hash_op_f = hal_rtl_eddsa_hook_sign_vrf_hash_op_f,
#endif
};

static inline void *eddsa_rom_memset(void *dst, int c, size_t n)
{
	if (n != 0) {
		unsigned char *d = dst;

		do {
			*d++ = (unsigned char)c;
		} while (--n > 0);
	}
	return dst;
}

/**
 * @addtogroup hs_hal_eddsa EDDSA
 * @{
 */

/// @cond DOXYGEN_ROM_HAL_API

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_init(phal_crypto_eddsa_t adtr)
{
#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#else
	hal_rtl_sys_peripheral_en(EDDSA_SYS, ENABLE);
#endif
	return SUCCESS;
}

#else
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_init(phal_crypto_eddsa_t peddsa_adtr, hal_crypto_adapter_t *pcrypto_adapter, uint8_t hash_crypto_sel)
{
	int ret = SUCCESS;
	if (peddsa_adtr == NULL) {
		return HAL_ERR_PARA;
	}
	_memset(peddsa_adtr, 0x0, sizeof(hal_crypto_eddsa_t));
	peddsa_adtr->base_addr = EDDSA_MODULE;
	if (EDDSA_HASH_CRYPTO_HW_SEL_EN == hash_crypto_sel) {
		// init ceypto engine
		if (NULL == pcrypto_adapter) {
			return HAL_ERR_PARA;
		} else {
			if (_TRUE != pcrypto_adapter->isInit) {
				dbg_printf("EdDSA: HW Crypto not init yet!\r\n");
				return HAL_NOT_READY;
			} else {
				peddsa_adtr->pcrypto_adtr = pcrypto_adapter;
				peddsa_adtr->isHWCrypto_Init = _TRUE;
			}
		}
	}
	peddsa_adtr->hash_crypto_sel = hash_crypto_sel;
#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#else
	hal_rtl_sys_peripheral_en(EDDSA_SYS, ENABLE);
#endif
	peddsa_adtr->isInit = _TRUE;
	peddsa_adtr->isMemDump = DISABLE;
	ret = hal_rtl_eddsa_hook_hash_op_f(peddsa_adtr, NULL, NULL, NULL);
	hal_rtl_eddsa_hook_sign_vrf_hash_op_f(peddsa_adtr, NULL);
	return ret;
}
#endif

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_hook_hash_op_f(hal_crypto_eddsa_t *peddsa_adtr, eddsa_hash_init_func_t hash_init_f,
								 eddsa_hash_update_func_t hash_update_f, eddsa_hash_final_func_t hash_final_f)
{
	int ret = SUCCESS;
	if (NULL == peddsa_adtr) {
		return HAL_ERR_PARA;
	}
	if (peddsa_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}

	hal_rtl_eddsa_hash_init_hook(peddsa_adtr, hash_init_f);
	hal_rtl_eddsa_hash_update_hook(peddsa_adtr, hash_update_f);
	hal_rtl_eddsa_hash_final_hook(peddsa_adtr, hash_final_f);

	return ret;
}

SECTION_EDDSA_TEXT
static int hal_rtl_eddsa_sha2_512_init(void *arg)
{
	hal_crypto_eddsa_t *peddsa_adtr = (hal_crypto_eddsa_t *)arg;
	int ret;
	if (NULL == peddsa_adtr) {
		return HAL_ERR_PARA;
	}
	if (EDDSA_HASH_CRYPTO_HW_SEL_EN == peddsa_adtr->hash_crypto_sel) {
		if (NULL == peddsa_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		ret = hal_rtl_crypto_auth_init(peddsa_adtr->pcrypto_adtr, AUTH_TYPE_SHA2_512_ALL, NULL, 0);
	}
	return ret;
}

SECTION_EDDSA_TEXT
static int hal_rtl_eddsa_sha2_512_update(void *arg, const uint8_t *message, const uint32_t msglen)
{
	hal_crypto_eddsa_t *peddsa_adtr = (hal_crypto_eddsa_t *)arg;
	int ret;
	if (NULL == peddsa_adtr) {
		return HAL_ERR_PARA;
	}
	if (EDDSA_HASH_CRYPTO_HW_SEL_EN == peddsa_adtr->hash_crypto_sel) {
		if (NULL == peddsa_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		ret = hal_rtl_crypto_auth_update(peddsa_adtr->pcrypto_adtr, AUTH_TYPE_SHA2_512_ALL, message, msglen);
	}
	return ret;
}

SECTION_EDDSA_TEXT
static int hal_rtl_eddsa_sha2_512_final(void *arg, uint8_t *pDigest)
{
	hal_crypto_eddsa_t *peddsa_adtr = (hal_crypto_eddsa_t *)arg;
	int ret;
	if (NULL == peddsa_adtr) {
		return HAL_ERR_PARA;
	}
	if (EDDSA_HASH_CRYPTO_HW_SEL_EN == peddsa_adtr->hash_crypto_sel) {
		if (NULL == peddsa_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		ret = hal_rtl_crypto_auth_final(peddsa_adtr->pcrypto_adtr, AUTH_TYPE_SHA2_512_ALL, pDigest);
	}
	return ret;
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_hash_init_hook(hal_crypto_eddsa_t *peddsa_adtr, eddsa_hash_init_func_t hash_init_f)
{
	if (NULL != hash_init_f) {
		peddsa_adtr->hash_init_f = hash_init_f;
	} else {
		if (EDDSA_HASH_CRYPTO_HW_SEL_EN == (peddsa_adtr->hash_crypto_sel)) {
			peddsa_adtr->hash_init_f = hal_rtl_eddsa_sha2_512_init;
		}
	}
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_hash_update_hook(hal_crypto_eddsa_t *peddsa_adtr, eddsa_hash_update_func_t hash_update_f)
{
	u16 hmac_alg_sel = 0;
	if (NULL != hash_update_f) {
		peddsa_adtr->hash_update_f = hash_update_f;
	} else {
		if (EDDSA_HASH_CRYPTO_HW_SEL_EN == (peddsa_adtr->hash_crypto_sel)) {
			peddsa_adtr->hash_update_f = hal_rtl_eddsa_sha2_512_update;
		}
	}
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_hash_final_hook(hal_crypto_eddsa_t *peddsa_adtr, eddsa_hash_final_func_t hash_final_f)
{
	u16 hmac_alg_sel = 0;
	if (NULL != hash_final_f) {
		peddsa_adtr->hash_final_f = hash_final_f;
	} else {
		if (EDDSA_HASH_CRYPTO_HW_SEL_EN == (peddsa_adtr->hash_crypto_sel)) {
			peddsa_adtr->hash_final_f = hal_rtl_eddsa_sha2_512_final;
		}
	}
}

SECTION_EDDSA_TEXT
static int hal_rtl_eddsa_sign_vrf_hash_op(void *arg)
{
	int ret = SUCCESS;
	phal_crypto_eddsa_t peddsa_adtr = (hal_crypto_eddsa_t *)arg;
	const unsigned char *sig, *msg, *pk;
	unsigned char *p_digest;
	unsigned long long mlen;
	/* 2. SW implement
	 * Points A  :public key
	 * Points R  :signature first 32bytes [0:31]
	 * M: message
	 * h: 64bytes digest
	 */

	pk = peddsa_adtr->p_pbk;
	sig = peddsa_adtr->p_signature;
	msg = peddsa_adtr->p_msg;
	mlen = peddsa_adtr->msglen;
	p_digest = &(peddsa_adtr->sha512_digest[0]);

	peddsa_adtr->hash_init_f(peddsa_adtr);
	peddsa_adtr->hash_update_f(peddsa_adtr, sig, 32);
	peddsa_adtr->hash_update_f(peddsa_adtr, pk, 32);
	peddsa_adtr->hash_update_f(peddsa_adtr, msg, mlen);
	peddsa_adtr->hash_final_f(peddsa_adtr, p_digest);
	//__mem_dump(p_digest, 64 , "sign_vrf_hash_op_digest");
	return ret;
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_hook_sign_vrf_hash_op_f(hal_crypto_eddsa_t *peddsa_adtr, eddsa_sign_vrf_hash_op sign_vrf_hash_f)
{
	if (NULL != sign_vrf_hash_f) {
		peddsa_adtr->sign_vrf_hash_f = sign_vrf_hash_f;
	} else {
		peddsa_adtr->sign_vrf_hash_f = hal_rtl_eddsa_sign_vrf_hash_op;
	}
}
#endif

SECTION_EDDSA_TEXT
int hal_rtl_eddsa_deinit(phal_crypto_eddsa_t adtr)
{
#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#else
	hal_rtl_sys_peripheral_en(EDDSA_SYS, DISABLE);
#endif
	return SUCCESS;
}

SECTION_EDDSA_TEXT
int hal_rtl_eddsa_verify_32(const unsigned char *new_v, const unsigned char *old_v)
{
	unsigned int differentbits = 0;
	uint32_t i;
	for (i = 0; i < 32; i++) {
		differentbits |= (new_v[i] ^ old_v[i]);
	}
	return (1 & ((differentbits - 1) >> 8)) - 1;
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_seq_set_word_from_byte(const uint32_t base_addr, const uint32_t seq_offset, const uint32_t s_val_len,
		const unsigned char *s_value)
{

