swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
	volatile u32 val = 0x0;
	uint32_t i;
	const unsigned char *p_s_value = s_value;
	for (i = 0 ; i < s_val_len; i += 4) {
#if 0
		(val) = (((uint32_t)(s_value)[(i)    ]
				  | ((uint32_t)(s_value)[(i) + 1] <<  8)
				  | ((uint32_t)(s_value)[(i) + 2] << 16)
				  | ((uint32_t)(s_value)[(i) + 3] << 24));
#endif

				 val |= ((uint32_t)p_s_value[i]);
				 val |= ((uint32_t)p_s_value[i + 1] << 8);
				 val |= ((uint32_t)p_s_value[i + 2] << 16);
				 val |= ((uint32_t)p_s_value[i + 3] << 24);

				 HAL_WRITE32((uint32_t)base_addr, (seq_offset + i), val);
	}
}

#if 0
// save for debug use
SECTION_EDDSA_TEXT
void hal_rtl_eddsa_seq_set_word_from_byte(const uint32_t base_addr, const uint32_t seq_offset, const uint32_t s_val_len,
		const unsigned char *s_value)
{

	volatile u32 val = 0x0;
	uint32_t i;
	//__dbg_mem_dump(peddsa_adapter->isMemDump, s_value,s_val_len,"set seq_value");
	for (i = 0 ; i < s_val_len; i += 4) {
		(val) = (((uint32_t)(s_value)[(i)    ])
				 | ((uint32_t)(s_value)[(i) + 1] <<  8)
				 | ((uint32_t)(s_value)[(i) + 2] << 16)
				 | ((uint32_t)(s_value)[(i) + 3] << 24));

		HAL_WRITE32((uint32_t)base_addr, (seq_offset + i), val);
	}
}

// save for debug use
SECTION_EDDSA_TEXT
void hal_rtl_eddsa_seq_get_word_from_byte(const uint32_t base_addr, const uint32_t seq_offset, const uint32_t s_val_len,
		unsigned char *s_value)
{

	volatile u32 val;
	uint32_t i;
	for (i = 0 ; i < s_val_len; i += 4) {
		val = HAL_READ32((uint32_t)base_addr, (seq_offset + i));
		(s_value)[(i)    ] = (unsigned char)(((val)) & 0xFF);
		(s_value)[(i) + 1] = (unsigned char)(((val) >>  8) & 0xFF);
		(s_value)[(i) + 2] = (unsigned char)(((val) >> 16) & 0xFF);
		(s_value)[(i) + 3] = (unsigned char)(((val) >> 24) & 0xFF);
	}
	//__dbg_mem_dump(peddsa_adapter->isMemDump, s_value,s_val_len,"get seq_value");
}


SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_word_value(const uint32_t base_addr, const uint32_t offset, const uint32_t w_value)
{

	volatile u32 val = 0x0;
	val |= w_value;
	HAL_WRITE32((uint32_t)base_addr, offset, val);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_word_value(const uint32_t base_addr, const uint32_t offset, uint32_t *w_buf)
{

	volatile u32 val = 0x0;
	val = HAL_READ32((uint32_t)base_addr, offset);
	*w_buf = val;
}
#endif

SECTION_EDDSA_TEXT
uint32_t hal_rtl_eddsa_set_word_from_byte(const unsigned char *s_value)
{
	volatile uint32_t val = 0x0;
	(val) = (((uint32_t)(s_value)[0])
			 | ((uint32_t)(s_value)[1] <<  8)
			 | ((uint32_t)(s_value)[2] << 16)
			 | ((uint32_t)(s_value)[3] << 24));
	return val;
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_x1_in_val(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	peddsa_obj->EDDSA_ENG_X1_P0_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 0)));
	peddsa_obj->EDDSA_ENG_X1_P1_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 1)));
	peddsa_obj->EDDSA_ENG_X1_P2_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 2)));
	peddsa_obj->EDDSA_ENG_X1_P3_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 3)));
	peddsa_obj->EDDSA_ENG_X1_P4_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 4)));
	peddsa_obj->EDDSA_ENG_X1_P5_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 5)));
	peddsa_obj->EDDSA_ENG_X1_P6_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 6)));
	peddsa_obj->EDDSA_ENG_X1_P7_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_y1_in_val(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	peddsa_obj->EDDSA_ENG_Y1_P0_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 0)));
	peddsa_obj->EDDSA_ENG_Y1_P1_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 1)));
	peddsa_obj->EDDSA_ENG_Y1_P2_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 2)));
	peddsa_obj->EDDSA_ENG_Y1_P3_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 3)));
	peddsa_obj->EDDSA_ENG_Y1_P4_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 4)));
	peddsa_obj->EDDSA_ENG_Y1_P5_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 5)));
	peddsa_obj->EDDSA_ENG_Y1_P6_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 6)));
	peddsa_obj->EDDSA_ENG_Y1_P7_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_x2_in_val(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	peddsa_obj->EDDSA_ENG_X2_P0_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 0)));
	peddsa_obj->EDDSA_ENG_X2_P1_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 1)));
	peddsa_obj->EDDSA_ENG_X2_P2_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 2)));
	peddsa_obj->EDDSA_ENG_X2_P3_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 3)));
	peddsa_obj->EDDSA_ENG_X2_P4_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 4)));
	peddsa_obj->EDDSA_ENG_X2_P5_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 5)));
	peddsa_obj->EDDSA_ENG_X2_P6_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 6)));
	peddsa_obj->EDDSA_ENG_X2_P7_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_y2_in_val(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	peddsa_obj->EDDSA_ENG_Y2_P0_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 0)));
	peddsa_obj->EDDSA_ENG_Y2_P1_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 1)));
	peddsa_obj->EDDSA_ENG_Y2_P2_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 2)));
	peddsa_obj->EDDSA_ENG_Y2_P3_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 3)));
	peddsa_obj->EDDSA_ENG_Y2_P4_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 4)));
	peddsa_obj->EDDSA_ENG_Y2_P5_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 5)));
	peddsa_obj->EDDSA_ENG_Y2_P6_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 6)));
	peddsa_obj->EDDSA_ENG_Y2_P7_REG = hal_rtl_eddsa_set_word_from_byte((s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_byte_from_word(const uint32_t reg_val, unsigned char *s_value)
{

	volatile uint32_t val = reg_val;
	(s_value)[0    ] = (unsigned char)(((val)) & 0xFF);
	(s_value)[1    ] = (unsigned char)(((val) >>  8) & 0xFF);
	(s_value)[2    ] = (unsigned char)(((val) >> 16) & 0xFF);
	(s_value)[3    ] = (unsigned char)(((val) >> 24) & 0xFF);
	//__dbg_mem_dump(peddsa_adapter->isMemDump, s_value,s_val_len,"get seq_value");
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_x1_out_val(const uint32_t base_addr, unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	volatile uint32_t val;
	val = peddsa_obj->EDDSA_ENG_XO1_P0_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 0)));
	val = peddsa_obj->EDDSA_ENG_XO1_P1_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 1)));
	val = peddsa_obj->EDDSA_ENG_XO1_P2_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 2)));
	val = peddsa_obj->EDDSA_ENG_XO1_P3_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 3)));
	val = peddsa_obj->EDDSA_ENG_XO1_P4_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 4)));
	val = peddsa_obj->EDDSA_ENG_XO1_P5_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 5)));
	val = peddsa_obj->EDDSA_ENG_XO1_P6_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 6)));
	val = peddsa_obj->EDDSA_ENG_XO1_P7_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_y1_out_val(const uint32_t base_addr, unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	volatile uint32_t val;
	val = peddsa_obj->EDDSA_ENG_YO1_P0_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 0)));
	val = peddsa_obj->EDDSA_ENG_YO1_P1_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 1)));
	val = peddsa_obj->EDDSA_ENG_YO1_P2_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 2)));
	val = peddsa_obj->EDDSA_ENG_YO1_P3_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 3)));
	val = peddsa_obj->EDDSA_ENG_YO1_P4_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 4)));
	val = peddsa_obj->EDDSA_ENG_YO1_P5_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 5)));
	val = peddsa_obj->EDDSA_ENG_YO1_P6_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 6)));
	val = peddsa_obj->EDDSA_ENG_YO1_P7_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_x2_out_val(const uint32_t base_addr, unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	volatile uint32_t val;
	val = peddsa_obj->EDDSA_ENG_XO2_P0_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 0)));
	val = peddsa_obj->EDDSA_ENG_XO2_P1_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 1)));
	val = peddsa_obj->EDDSA_ENG_XO2_P2_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 2)));
	val = peddsa_obj->EDDSA_ENG_XO2_P3_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 3)));
	val = peddsa_obj->EDDSA_ENG_XO2_P4_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 4)));
	val = peddsa_obj->EDDSA_ENG_XO2_P5_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 5)));
	val = peddsa_obj->EDDSA_ENG_XO2_P6_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 6)));
	val = peddsa_obj->EDDSA_ENG_XO2_P7_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_y2_out_val(const uint32_t base_addr, unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	volatile uint32_t val;
	val = peddsa_obj->EDDSA_ENG_YO2_P0_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 0)));
	val = peddsa_obj->EDDSA_ENG_YO2_P1_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 1)));
	val = peddsa_obj->EDDSA_ENG_YO2_P2_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 2)));
	val = peddsa_obj->EDDSA_ENG_YO2_P3_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 3)));
	val = peddsa_obj->EDDSA_ENG_YO2_P4_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 4)));
	val = peddsa_obj->EDDSA_ENG_YO2_P5_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 5)));
	val = peddsa_obj->EDDSA_ENG_YO2_P6_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 6)));
	val = peddsa_obj->EDDSA_ENG_YO2_P7_REG;
	hal_rtl_eddsa_get_byte_from_word((const uint32_t)val, (s_value + (POINT_DATA_VAL_OFFSET * 7)));
}

