swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
#if 0
SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_word_value(const uint32_t base_addr, const uint32_t offset, const uint32_t w_value)
{

	volatile u32 val = 0x0;
	val |= w_value;
	HAL_WRITE32((uint32_t)base_addr, offset, val);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_word_value(const uint32_t base_addr, const uint32_t offset, uint32_t *w_buf)
{

	volatile u32 val = 0x0;
	val = HAL_READ32((uint32_t)base_addr, offset);
	*w_buf = val;
}
#endif

SECTION_EDDSA_TEXT
int hal_rtl_eddsa_polling_wait_done(phal_crypto_eddsa_t peddsa_adapter)
{

	EDDSA_TypeDef *peddsa_obj;
	volatile uint32_t val;
	uint32_t int_sts;
	uint32_t loopWait;
	peddsa_obj = peddsa_adapter->base_addr;

#if 0
	// RAM CODE HOOK CALLBACK FUNC
	if (pcrypto_adapter->wait_done_func != NULL) {
		DBG_CRYPTO_INFO("Interrupt Handler way[Use pcrypto_adapter->wait_done_func]!\r\n");
		return pcrypto_adapter->wait_done_func(pcrypto_adapter);
	}
#endif
	// wait until ipsec engine stop
	loopWait = 1000000; /* hope long enough */
	while (1) {
		val = peddsa_obj->EDDSA_ENG_CONF_INT_REG;
		//hal_rtl_eddsa_get_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CONF_INT_REG_OFFSET, &val);

		int_sts = (val & (EDDSA_BIT_MODE0_FINISH | EDDSA_BIT_MODE1_FINISH |
						  EDDSA_BIT_MODE2_FINISH | EDDSA_BIT_MODE3_FINISH));
		//DBG_EDDSA_INFO("int_sts = 0x%x\r\n",int_sts);
		if (int_sts) {
			val = 0x0;
			if (int_sts & EDDSA_BIT_MODE0_FINISH) {
				val |= EDDSA_BIT_MODE0_FINISH;
				DBG_EDDSA_INFO("mode0 finsih!\r\n");
			}
			if (int_sts & EDDSA_BIT_MODE1_FINISH) {
				val |= EDDSA_BIT_MODE1_FINISH;
				DBG_EDDSA_INFO("mode1 finsih!\r\n");
			}
			if (int_sts & EDDSA_BIT_MODE2_FINISH) {
				val |= EDDSA_BIT_MODE2_FINISH;
				DBG_EDDSA_INFO("mode2 finsih!\r\n");
			}
			if (int_sts & EDDSA_BIT_MODE3_FINISH) {
				val |= EDDSA_BIT_MODE3_FINISH;
				DBG_EDDSA_INFO("mode3 finsih!\r\n");
			}

			if (val) {
				// Clear interrupt status
				DBG_EDDSA_INFO("clear interrupt 0x%x\r\n", val);
				peddsa_obj->EDDSA_ENG_CONF_INT_REG = val;
				//HAL_WRITE32((uint32_t)peddsa_obj, EDDSA_ENG_CONF_INT_REG_OFFSET, val);
			}
			break;
		}

		loopWait--;
		if (loopWait == 0) {
			DBG_EDDSA_INFO("Wait Timeout! int_sts = 0x%x\r\n", val);
			return FAIL; /* error occurs */
		}
	}
	return SUCCESS;

}

#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify(phal_crypto_eddsa_t peddsa_adapter)
{
	switch (peddsa_adapter->flow_mode) {
	case EDDSA_FLOW_STEPS:
		return hal_rtl_eddsa_sign_verify_steps(peddsa_adapter);
		break;
	case EDDSA_FLOW_SEMIAUTO:
		return hal_rtl_eddsa_sign_verify_semi_auto(peddsa_adapter);
		break;
	case EDDSA_FLOW_AUTOFLOW:
		return hal_rtl_eddsa_sign_verify_autoflow(peddsa_adapter);
		break;
	default:
		return hal_rtl_eddsa_sign_verify_steps(peddsa_adapter);
		break;
	}
}

#else
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify(phal_crypto_eddsa_t peddsa_adtr,
							  const unsigned char *sig, const unsigned char *msg,
							  const unsigned char *pk, const uint32_t msglen,
							  unsigned char mode_sel, unsigned char recover_en)
{
	int ret = SUCCESS;
	peddsa_adtr->p_pbk = (uint8_t *) pk;
	peddsa_adtr->p_signature = (uint8_t *) sig;
	peddsa_adtr->p_msg = (uint8_t *) msg;
	peddsa_adtr->msglen = msglen;
	//DBG_EDDSA_INFO("p_pbk = 0x%x\r\n", peddsa_adtr->p_pbk);
	//DBG_EDDSA_INFO("p_sig = 0x%x\r\n", peddsa_adtr->p_signature);
	//DBG_EDDSA_INFO("p_msg = 0x%x\r\n", peddsa_adtr->p_msg);
	//DBG_EDDSA_INFO("msglen = %d\r\n", peddsa_adtr->msglen);

	// Whether turn-on recover
	peddsa_adtr->point_recover_en = recover_en;

	// select
	peddsa_adtr->sB_write_out_en = 1;

	// select
	peddsa_adtr->kA_write_out_en = 1;

	// auto-step select[Depend on what kinds of autoflow step(all or partial)]
	peddsa_adtr->flow_mode = mode_sel;
	ret = hal_rtl_eddsa_sign_verify_core(peddsa_adtr);
	return ret;
}

SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify_core(phal_crypto_eddsa_t peddsa_adapter)
{
	switch (peddsa_adapter->flow_mode) {
	case EDDSA_FLOW_STEPS:
		return hal_rtl_eddsa_sign_verify_steps(peddsa_adapter);
		break;
	case EDDSA_FLOW_SEMIAUTO:
		return hal_rtl_eddsa_sign_verify_semi_auto(peddsa_adapter);
		break;
	case EDDSA_FLOW_AUTOFLOW:
		return hal_rtl_eddsa_sign_verify_autoflow(peddsa_adapter);
		break;
	default:
		return hal_rtl_eddsa_sign_verify_steps(peddsa_adapter);
		break;
	}
}
#endif

// Autoflow all
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify_autoflow(phal_crypto_eddsa_t peddsa_adapter)
{

	EDDSA_TypeDef *peddsa_obj;
	peddsa_obj = peddsa_adapter->base_addr;
	const unsigned char *pbk        = peddsa_adapter->p_pbk;
	const unsigned char *sig_r      = (peddsa_adapter->p_signature);
	const unsigned char *sig_s      = ((peddsa_adapter->p_signature) + SIGNATURE_OFFSET_S);
	unsigned char *p_x_buf, *p_y_buf;
	unsigned char *p_digest, *p_rcheck;
	int ret = SUCCESS;

	// Set signature_s
	hal_rtl_eddsa_set_signature_s((uint32_t)peddsa_obj, sig_s);
	DBG_EDDSA_INFO("set signature ok\r\n");

	if (1 == (peddsa_adapter->point_recover_en)) {
		// Set encode public key
		hal_rtl_eddsa_set_encode_pbk((uint32_t)peddsa_obj, pbk);
		DBG_EDDSA_INFO("set public key ok\r\n");
	}

	// Set recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	uint32_t val = 0x0;
	if (0 == (peddsa_adapter->point_recover_en)) {
		DBG_EDDSA_WARN("point_recover_en should be turned-on when autoflow\r\n");
		return HAL_ERR_PARA;
	}
	// Turn-on by default
	val |= EDDSA_BIT_RECOVER_X_EN;
	val |= (EDDSA_MODE0 << EDDSA_SHIFT_MOD_SEL);
	val |= (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL);
	val |= EDDSA_BIT_AUTO_SP;

	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = EDDSA_BIT_ENG_START;

	// Run hash SHA512 sw algorithm
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	if (peddsa_adapter->hash_exec_func != NULL) {
		ret = (peddsa_adapter->hash_exec_func)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("No-hook hash function\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#else
	if (peddsa_adapter->sign_vrf_hash_f != NULL) {
		ret = (peddsa_adapter->sign_vrf_hash_f)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("No-hook hash function\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#endif

	// Set hash digest 64 bytes (input x1,input y1)
	if (1 == (peddsa_adapter->isHashok)) {
		p_digest = &(peddsa_adapter->sha512_digest[0]);
		uint8_t sha512_bypass = 0;
		hal_rtl_eddsa_set_hash_digest((uint32_t)peddsa_obj, p_digest,
									  (p_digest + POINT_AXIS_VAL_SIZE), sha512_bypass);
	} else {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Set hash ok
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = EDDSA_BIT_HASH_OK;

