swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
	// Bypass step2, step3

	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Rx, Ry
	p_x_buf = &(peddsa_adapter->rcheck_point[0][0]);
	p_y_buf = &(peddsa_adapter->rcheck_point[1][0]);
	hal_rtl_eddsa_get_Rplus((uint32_t)peddsa_obj, p_x_buf, p_y_buf);

	// Check encode Ry -> yo2
	p_rcheck = &(peddsa_adapter->rcheck_enc[0]);
	hal_rtl_eddsa_get_enc_Rplus((uint32_t)peddsa_obj, p_rcheck);

	ret = hal_rtl_eddsa_verify_32(p_rcheck, sig_r);
	if (ret != SUCCESS) {
		ret = FAIL;
		__dbg_mem_dump(peddsa_adapter->isMemDump, p_rcheck, POINT_AXIS_VAL_SIZE, "dump p_rcheck");
		__dbg_mem_dump(peddsa_adapter->isMemDump, sig_r, POINT_AXIS_VAL_SIZE, "dump signature_r");
	} else {
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[0][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_x");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[1][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_y");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_enc[0]), POINT_AXIS_VAL_SIZE, "dump rcheck_enc");
	}

hal_rtl_eddsa_sign_verify_end:
	return ret;
}

// Step1+Autoflow(Step2+3)
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify_semi_auto(phal_crypto_eddsa_t peddsa_adapter)
{

	EDDSA_TypeDef *peddsa_obj;
	peddsa_obj = peddsa_adapter->base_addr;
	const unsigned char *pbk        = peddsa_adapter->p_pbk;
	const unsigned char *sig_r      = (peddsa_adapter->p_signature);
	const unsigned char *sig_s      = ((peddsa_adapter->p_signature) + SIGNATURE_OFFSET_S);
	unsigned char *p_x_buf, *p_y_buf;
	unsigned char *p_digest, *p_rcheck;
	int ret = SUCCESS;

	// Set signature_s
	hal_rtl_eddsa_set_signature_s((uint32_t)peddsa_obj, sig_s);
	DBG_EDDSA_INFO("set signature ok\r\n");

	if (1 == (peddsa_adapter->point_recover_en)) {
		// Set encode public key
		hal_rtl_eddsa_set_encode_pbk((uint32_t)peddsa_obj, pbk);
		DBG_EDDSA_INFO("set public key ok\r\n");
	}

	// Set recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	uint32_t val = 0x0;
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
	val |= ((EDDSA_MODE0 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = EDDSA_BIT_ENG_START;

	// Run hash SHA512 sw algorithm
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	if (peddsa_adapter->hash_exec_func != NULL) {
		ret = (peddsa_adapter->hash_exec_func)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("Non-hook Hash function!\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#else
	if (peddsa_adapter->sign_vrf_hash_f != NULL) {
		ret = (peddsa_adapter->sign_vrf_hash_f)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("Non-hook Hash function!\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#endif

	if (0 == (peddsa_adapter->point_recover_en)) {
		if (peddsa_adapter->decompress_exec_func != NULL) {
			ret = (peddsa_adapter->decompress_exec_func)(peddsa_adapter);
			if (ret != SUCCESS) {
				goto hal_rtl_eddsa_sign_verify_end;
			} else {
				peddsa_adapter->isDecompress_pbk_ok = 1;
			}
		} else {
			DBG_EDDSA_INFO("Non-hook Decompress function!\r\n");
			ret = FAIL;
			goto hal_rtl_eddsa_sign_verify_end;
		}
	}

	// Check mode 0 interrupt signal occur
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Recover public key values(xo2,yo2) if recover x point enable
	if (1 == (peddsa_adapter->point_recover_en)) {
		p_x_buf = &(peddsa_adapter->point_recover[0][0]);
		p_y_buf = &(peddsa_adapter->point_recover[1][0]);
		hal_rtl_eddsa_get_recover_pbk((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

	// Check s x B point(x,y)
	if (1 == (peddsa_adapter->sB_write_out_en)) {
		p_x_buf = &(peddsa_adapter->sB_point[0][0]);
		p_y_buf = &(peddsa_adapter->sB_point[1][0]);
		hal_rtl_eddsa_get_sB((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

	// Set Recover public key values(xo2,yo2) if recover x point disable
	if (1 == (peddsa_adapter->isDecompress_pbk_ok)) {
		p_x_buf = &(peddsa_adapter->dec_pbk[0][0]);
		p_y_buf = &(peddsa_adapter->dec_pbk[1][0]);
		hal_rtl_eddsa_set_recover_pbk((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

	// Set hash digest 64 bytes (input x1,input y1)
	if (1 == (peddsa_adapter->isHashok)) {
		p_digest = &(peddsa_adapter->sha512_digest[0]);
		uint8_t sha512_bypass = 0;
		hal_rtl_eddsa_set_hash_digest((uint32_t)peddsa_obj, p_digest, (p_digest + POINT_AXIS_VAL_SIZE), sha512_bypass);
	} else {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Set Autoflow(Step2+3) recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	val = 0x0;
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
	val |= ((EDDSA_MODE1 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL)
			| EDDSA_BIT_AUTO_SP);
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = EDDSA_BIT_ENG_START;

	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Rx, Ry
	p_x_buf = &(peddsa_adapter->rcheck_point[0][0]);
	p_y_buf = &(peddsa_adapter->rcheck_point[1][0]);
	hal_rtl_eddsa_get_Rplus((uint32_t)peddsa_obj, p_x_buf, p_y_buf);

	// Check encode Ry -> yo2
	p_rcheck = &(peddsa_adapter->rcheck_enc[0]);
	hal_rtl_eddsa_get_enc_Rplus((uint32_t)peddsa_obj, p_rcheck);

	ret = hal_rtl_eddsa_verify_32(p_rcheck, sig_r);
	if (ret != SUCCESS) {
		ret = FAIL;
		__dbg_mem_dump(peddsa_adapter->isMemDump, p_rcheck, POINT_AXIS_VAL_SIZE, "dump p_rcheck");
		__dbg_mem_dump(peddsa_adapter->isMemDump, sig_r, POINT_AXIS_VAL_SIZE, "dump signature_r");
	} else {
		if (1 == (peddsa_adapter->sB_write_out_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[0][0]), POINT_AXIS_VAL_SIZE, "dump sxB_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[1][0]), POINT_AXIS_VAL_SIZE, "dump sxB_y");
		}
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[0][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_x");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[1][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_y");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_enc[0]), POINT_AXIS_VAL_SIZE, "dump rcheck_enc");
	}

hal_rtl_eddsa_sign_verify_end:
	return ret;
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_signature_s(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_set_x1_in_val((uint32_t)peddsa_obj, s_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_encode_pbk(const uint32_t base_addr, const unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_set_y2_in_val((uint32_t)peddsa_obj, s_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_recover_pbk(const uint32_t base_addr, const unsigned char *s_x_value, const unsigned char *s_y_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_set_x2_in_val((uint32_t)peddsa_obj, s_x_value);
	hal_rtl_eddsa_set_y2_in_val((uint32_t)peddsa_obj, s_y_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_set_hash_digest(const uint32_t base_addr, const unsigned char *s_x_value, const unsigned char *s_y_value, uint8_t bypass_en)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	if (0 == bypass_en) {
		// Set input: h[255:0] & h[511:256]
		hal_rtl_eddsa_set_x1_in_val((uint32_t)peddsa_obj, s_x_value);
		hal_rtl_eddsa_set_y1_in_val((uint32_t)peddsa_obj, s_y_value);
	} else {
		// Only Set input: h[255:0]
		hal_rtl_eddsa_set_x1_in_val((uint32_t)peddsa_obj, s_x_value);
	}
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_recover_pbk(const uint32_t base_addr, unsigned char *s_x_value, unsigned char *s_y_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_get_x2_out_val((uint32_t)peddsa_obj, s_x_value);
	hal_rtl_eddsa_get_y2_out_val((uint32_t)peddsa_obj, s_y_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_sB(const uint32_t base_addr, unsigned char *s_x_value, unsigned char *s_y_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_get_x1_out_val((uint32_t)peddsa_obj, s_x_value);
	hal_rtl_eddsa_get_y1_out_val((uint32_t)peddsa_obj, s_y_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_kA(const uint32_t base_addr, unsigned char *s_x_value, unsigned char *s_y_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_get_x2_out_val((uint32_t)peddsa_obj, s_x_value);
	hal_rtl_eddsa_get_y2_out_val((uint32_t)peddsa_obj, s_y_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_Rplus(const uint32_t base_addr, unsigned char *s_x_value, unsigned char *s_y_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_get_x1_out_val((uint32_t)peddsa_obj, s_x_value);
	hal_rtl_eddsa_get_y1_out_val((uint32_t)peddsa_obj, s_y_value);
}

SECTION_EDDSA_TEXT
void hal_rtl_eddsa_get_enc_Rplus(const uint32_t base_addr, unsigned char *s_value)
{
	EDDSA_TypeDef *peddsa_obj = (EDDSA_TypeDef *)base_addr;
	hal_rtl_eddsa_get_y2_out_val((uint32_t)peddsa_obj, s_value);
}


#if 1
// [Unify coding styles] Step1+Step2+Step3
SECTION_EDDSA_TEXT
int hal_rtl_eddsa_sign_verify_steps(phal_crypto_eddsa_t peddsa_adapter)
{

	EDDSA_TypeDef *peddsa_obj;
	peddsa_obj = peddsa_adapter->base_addr;
	const unsigned char *pbk        = peddsa_adapter->p_pbk;
	const unsigned char *sig_r      = (peddsa_adapter->p_signature);
	const unsigned char *sig_s      = ((peddsa_adapter->p_signature) + SIGNATURE_OFFSET_S);
	unsigned char *p_x_buf, *p_y_buf;
	unsigned char *p_digest, *p_rcheck;
	int ret = SUCCESS;

	// Set signature_s
	hal_rtl_eddsa_set_signature_s((uint32_t)peddsa_obj, sig_s);
	DBG_EDDSA_INFO("set signature ok\r\n");

	if (1 == (peddsa_adapter->point_recover_en)) {
		// Set encode public key
		hal_rtl_eddsa_set_encode_pbk((uint32_t)peddsa_obj, pbk);
		DBG_EDDSA_INFO("set public key ok\r\n");
	}

