swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
	// Set recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	uint32_t val = 0x0;
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
	val |= ((EDDSA_MODE0 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	val = EDDSA_BIT_ENG_START;
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = val;

	// Run hash SHA512 sw algorithm
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	if (peddsa_adapter->hash_exec_func != NULL) {
		ret = (peddsa_adapter->hash_exec_func)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("Non-hook Hash function!\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#else
	if (peddsa_adapter->sign_vrf_hash_f != NULL) {
		ret = (peddsa_adapter->sign_vrf_hash_f)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("Non-hook Hash function!\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
#endif

	if (0 == (peddsa_adapter->point_recover_en)) {
		if (peddsa_adapter->decompress_exec_func != NULL) {
			ret = (peddsa_adapter->decompress_exec_func)(peddsa_adapter);
			if (ret != SUCCESS) {
				goto hal_rtl_eddsa_sign_verify_end;
			} else {
				peddsa_adapter->isDecompress_pbk_ok = 1;
			}
		} else {
			DBG_EDDSA_INFO("Non-hook Decompress function!\r\n");
			ret = FAIL;
			goto hal_rtl_eddsa_sign_verify_end;
		}
	}

	// Check mode 0 interrupt signal occur
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Recover public key values(xo2,yo2) if recover x point enable
	if (1 == (peddsa_adapter->point_recover_en)) {
		p_x_buf = &(peddsa_adapter->point_recover[0][0]);
		p_y_buf = &(peddsa_adapter->point_recover[1][0]);
		hal_rtl_eddsa_get_recover_pbk((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

	// Check s x B point(xo1,yo1)
	if (1 == (peddsa_adapter->sB_write_out_en)) {
		p_x_buf = &(peddsa_adapter->sB_point[0][0]);
		p_y_buf = &(peddsa_adapter->sB_point[1][0]);
		hal_rtl_eddsa_get_sB((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

#if 1
	// Set Recover public key values(xo2,yo2) if recover x point disable
	if ((1 == (peddsa_adapter->isDecompress_pbk_ok)) || (1 == (peddsa_adapter->point_recover_en))) {
		if (1 == (peddsa_adapter->isDecompress_pbk_ok)) {
			p_x_buf = &(peddsa_adapter->dec_pbk[0][0]);
			p_y_buf = &(peddsa_adapter->dec_pbk[1][0]);
		} else if (1 == (peddsa_adapter->point_recover_en)) {
			p_x_buf = &(peddsa_adapter->point_recover[0][0]);
			p_y_buf = &(peddsa_adapter->point_recover[1][0]);
		}
		hal_rtl_eddsa_set_recover_pbk((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}
#endif
#if 0
	// SW set a wrong value
	p_x_buf = &(peddsa_adapter->point_recover[0][0]);
	p_y_buf = &(peddsa_adapter->point_recover[1][0]);
	eddsa_rom_memset(p_x_buf, 0x0, 32);
	eddsa_rom_memset(p_y_buf, 0x0, 32);
	hal_rtl_eddsa_set_recover_pbk((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
#endif
	// Set hash digest 64 bytes (input x1,input y1)
	if (1 == (peddsa_adapter->isHashok)) {
		p_digest = &(peddsa_adapter->sha512_digest[0]);
		uint8_t sha512_bypass = 0;
		hal_rtl_eddsa_set_hash_digest((uint32_t)peddsa_obj, p_digest, (p_digest + POINT_AXIS_VAL_SIZE), sha512_bypass);
	} else {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}


	// Set Step2, recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	val = 0x0;
#if 0
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
#endif
	val |= ((EDDSA_MODE1 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	val = EDDSA_BIT_ENG_START;
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = val;

	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check h x A result(xo2,yo2)
	if (1 == (peddsa_adapter->kA_write_out_en)) {
		p_x_buf = &(peddsa_adapter->kA_point[0][0]);
		p_y_buf = &(peddsa_adapter->kA_point[1][0]);
		hal_rtl_eddsa_get_kA((uint32_t)peddsa_obj, p_x_buf, p_y_buf);
	}

	// Set Step3, mode_self/func_sel
	val = 0x0;
	val |= ((EDDSA_MODE2 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	peddsa_obj->EDDSA_ENG_CTRL_REG = val;

	// Set engine start
	val = EDDSA_BIT_ENG_START;
	peddsa_obj->EDDSA_ENG_CONF_INT_REG = val;

	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Rx, Ry
	p_x_buf = &(peddsa_adapter->rcheck_point[0][0]);
	p_y_buf = &(peddsa_adapter->rcheck_point[1][0]);
	hal_rtl_eddsa_get_Rplus((uint32_t)peddsa_obj, p_x_buf, p_y_buf);

	// Check encode Ry -> yo2
	p_rcheck = &(peddsa_adapter->rcheck_enc[0]);
	hal_rtl_eddsa_get_enc_Rplus((uint32_t)peddsa_obj, p_rcheck);

	ret = hal_rtl_eddsa_verify_32(p_rcheck, sig_r);
	if (ret != SUCCESS) {
		ret = FAIL;
		__dbg_mem_dump(peddsa_adapter->isMemDump, p_rcheck, POINT_AXIS_VAL_SIZE, "dump p_rcheck");
		__dbg_mem_dump(peddsa_adapter->isMemDump, sig_r, POINT_AXIS_VAL_SIZE, "dump signature_r");
	} else {
		if (1 == (peddsa_adapter->point_recover_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->point_recover[0][0]), POINT_AXIS_VAL_SIZE, "dump hwdec_pbk_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->point_recover[1][0]), POINT_AXIS_VAL_SIZE, "dump hwdec_pbk_y");
		}
		if (1 == (peddsa_adapter->sB_write_out_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[0][0]), POINT_AXIS_VAL_SIZE, "dump sxB_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[1][0]), POINT_AXIS_VAL_SIZE, "dump sxB_y");
		}
		if (1 == (peddsa_adapter->kA_write_out_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->kA_point[0][0]), POINT_AXIS_VAL_SIZE, "dump kxA_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->kA_point[1][0]), POINT_AXIS_VAL_SIZE, "dump kxA_y");
		}
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[0][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_x");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[1][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_y");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_enc[0]), POINT_AXIS_VAL_SIZE, "dump rcheck_enc");
	}

hal_rtl_eddsa_sign_verify_end:
	return ret;
}
#endif


