swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
#if 0

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)

/**
 *   \brief  The data struct of CRYPTO non-secure stub functions. ROM code functions are accessed in RAM code through stub functions.
 */
SECTION_CRYPTO_STUBS
const hal_crypto_func_stubs_t hal_crypto_stubs_ns = {
	.hal_crypto_engine_init   = hal_rtl_crypto_engine_init,
	.hal_crypto_engine_deinit = hal_rtl_crypto_engine_deinit,
	.hal_crypto_engine_platform_en_ctrl = hal_rtl_crypto_en_ctrl,

	.hal_crypto_auth         = hal_rtl_crypto_auth,
	.hal_crypto_auth_init    = hal_rtl_crypto_auth_init,
	.hal_crypto_auth_process = hal_rtl_crypto_auth_process,
	.hal_crypto_auth_update  = hal_rtl_crypto_auth_update,
	.hal_crypto_auth_final   = hal_rtl_crypto_auth_final,

	.hal_crypto_cipher_init     = hal_rtl_crypto_cipher_init,
	.hal_crypto_cipher_encrypt  = hal_rtl_crypto_cipher_encrypt,
	.hal_crypto_cipher_decrypt  = hal_rtl_crypto_cipher_decrypt,

	.hal_crypto_mix_mode_init     = hal_rtl_crypto_mix_mode_init,
	.hal_crypto_mix_mode_process  = hal_rtl_crypto_mix_mode_process,

	.hal_crypto_crc_setting       = hal_rtl_crypto_crc_setting,
	.hal_crypto_crc_cmd           = hal_rtl_crypto_crc_cmd,
	.hal_crypto_crc_dma           = hal_rtl_crypto_crc_dma,
	.hal_crypto_crc_get_result    = hal_rtl_crypto_crc_get_result,
	.hal_crypto_crc32_cmd         = hal_rtl_crypto_crc32_cmd,
	.hal_crypto_crc32_dma         = hal_rtl_crypto_crc32_dma,

	.hal_crypto_engine            = hal_rtl_crypto_engine,
	.hal_crypto_engine_get_result = hal_rtl_crypto_engine_get_result,
	.hal_crypto_set_srcdesc       = hal_rtl_crypto_set_srcdesc,
	.hal_crypto_set_dstdesc       = hal_rtl_crypto_set_dstdesc,
	.hal_crypto_engine_setup_cl_buffer = hal_rtl_crypto_engine_setup_cl_buffer,
};

#else

/**
 *   \brief  The data struct of CRYPTO secure stub functions. ROM code functions are accessed in RAM code through stub functions.
 */
SECTION_CRYPTO_STUBS
const hal_crypto_func_stubs_t hal_crypto_stubs_s = {
	.hal_crypto_engine_init   = hal_rtl_crypto_engine_init,
	.hal_crypto_engine_deinit = hal_rtl_crypto_engine_deinit,
	.hal_crypto_engine_platform_en_ctrl = hal_rtl_crypto_en_ctrl,

	.hal_crypto_auth         = hal_rtl_crypto_auth,
	.hal_crypto_auth_init    = hal_rtl_crypto_auth_init,
	.hal_crypto_auth_process = hal_rtl_crypto_auth_process,
	.hal_crypto_auth_update  = hal_rtl_crypto_auth_update,
	.hal_crypto_auth_final   = hal_rtl_crypto_auth_final,

	.hal_crypto_cipher_init     = hal_rtl_crypto_cipher_init,
	.hal_crypto_cipher_encrypt  = hal_rtl_crypto_cipher_encrypt,
	.hal_crypto_cipher_decrypt  = hal_rtl_crypto_cipher_decrypt,

	.hal_crypto_mix_mode_init     = hal_rtl_crypto_mix_mode_init,
	.hal_crypto_mix_mode_process  = hal_rtl_crypto_mix_mode_process,

	.hal_crypto_engine            = hal_rtl_crypto_engine,
	.hal_crypto_engine_get_result = hal_rtl_crypto_engine_get_result,
	.hal_crypto_set_srcdesc       = hal_rtl_crypto_set_srcdesc,
	.hal_crypto_set_dstdesc       = hal_rtl_crypto_set_dstdesc,
	.hal_crypto_engine_setup_cl_buffer = hal_rtl_crypto_engine_setup_cl_buffer,
};

#endif

/** @} */ /* End of group hs_hal_eddsa_rom_func */
/// @endcond
/** @} */ /* End of group hs_hal_eddsa */

#if 0
// Non-unify version
// Step1+Step2+Step3
SECTION_EDDSA_TEXT
int _hal_rtl_eddsa_sign_verify(steps)(phal_crypto_eddsa_t peddsa_adapter)
{

	EDDSA_TypeDef *peddsa_obj;
	peddsa_obj = peddsa_adapter->base_addr;
	const unsigned char *pbk        = peddsa_adapter->p_pbk;
	const unsigned char *sig_r      = (peddsa_adapter->p_signature);
	const unsigned char *sig_s      = ((peddsa_adapter->p_signature) + SIGNATURE_OFFSET_S);
	unsigned char *p_x_buf, *p_y_buf;
	unsigned char *p_digest, *p_rcheck;
	int ret = SUCCESS;

	// Set signature_s
	hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_X1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, sig_s);
	DBG_EDDSA_INFO("set signature ok\r\n");

	if (1 == (peddsa_adapter->point_recover_en)) {
		// Set encode public key
		hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_Y2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, pbk);
	}

	// Set recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	uint32_t val = 0x0;
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
	val |= ((EDDSA_MODE0 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CTRL_REG_OFFSET, val);

	// Set engine start
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CONF_INT_REG_OFFSET, EDDSA_BIT_ENG_START);

	// Run hash SHA512 sw algorithm
	if (peddsa_adapter->hash_exec_func != NULL) {
		ret = (peddsa_adapter->hash_exec_func)(peddsa_adapter);
		if (ret != SUCCESS) {
			goto hal_rtl_eddsa_sign_verify_end;
		} else {
			peddsa_adapter->isHashok = 1;
		}
	} else {
		DBG_EDDSA_INFO("Non-hook Hash function!\r\n");
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}
	if (0 == (peddsa_adapter->point_recover_en)) {
		if (peddsa_adapter->decompress_exec_func != NULL) {
			ret = (peddsa_adapter->decompress_exec_func)(peddsa_adapter);
			if (ret != SUCCESS) {
				goto hal_rtl_eddsa_sign_verify_end;
			} else {
				peddsa_adapter->isDecompress_pbk_ok = 1;
			}
		} else {
			DBG_EDDSA_INFO("Non-hook Decompress function!\r\n");
			ret = FAIL;
			goto hal_rtl_eddsa_sign_verify_end;
		}
	}

	// Check mode 0 interrupt signal occur
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		ret = FAIL;
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Recover public key values(xo2,yo2) if recover x point enable
	if (1 == (peddsa_adapter->point_recover_en)) {
		p_x_buf = &(peddsa_adapter->point_recover[0][0]);
		p_y_buf = &(peddsa_adapter->point_recover[1][0]);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_XO2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_YO2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);
	}

	// Check s x B point(xo1,yo1)
	if (1 == (peddsa_adapter->sB_write_out_en)) {
		p_x_buf = &(peddsa_adapter->sB_point[0][0]);
		p_y_buf = &(peddsa_adapter->sB_point[1][0]);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_XO1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_YO1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);
	}

#if 1
	// Set Recover public key values(xo2,yo2) if recover x point disable
	if ((1 == (peddsa_adapter->isDecompress_pbk_ok)) || (1 == (peddsa_adapter->point_recover_en))) {
		if (1 == (peddsa_adapter->isDecompress_pbk_ok)) {
			p_x_buf = &(peddsa_adapter->dec_pbk[0][0]);
			p_y_buf = &(peddsa_adapter->dec_pbk[1][0]);
		} else if (1 == (peddsa_adapter->point_recover_en)) {
			p_x_buf = &(peddsa_adapter->point_recover[0][0]);
			p_y_buf = &(peddsa_adapter->point_recover[1][0]);
		}
		hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_X2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
		hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_Y2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);
	}
#endif
#if 0
	// SW set a wrong value
	p_x_buf = &(peddsa_adapter->point_recover[0][0]);
	p_y_buf = &(peddsa_adapter->point_recover[1][0]);
	eddsa_rom_memset(p_x_buf, 0x0, 32);
	eddsa_rom_memset(p_y_buf, 0x0, 32);
	hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_X2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
	hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_Y2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);
#endif
	// Set hash digest 64 bytes (input x1,input y1)
	if (1 == (peddsa_adapter->isHashok)) {
		p_digest = &(peddsa_adapter->sha512_digest[0]);
		hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_X1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_digest);
		hal_rtl_eddsa_seq_set_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_Y1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, (p_digest + POINT_AXIS_VAL_SIZE));
	} else {
		goto hal_rtl_eddsa_sign_verify_end;
	}


	// Set Step2, recover x point(public key) or not & autoflow step enable or not & mode_self/func_sel
	val = 0x0;
#if 0
	if (1 == (peddsa_adapter->point_recover_en)) {
		val |= EDDSA_BIT_RECOVER_X_EN;
	}
#endif
	val |= ((EDDSA_MODE1 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CTRL_REG_OFFSET, val);

	// Set engine start
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CONF_INT_REG_OFFSET, EDDSA_BIT_ENG_START);

