swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_eddsa.c
	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check h x A result(xo2,yo2)
	if (1 == (peddsa_adapter->kA_write_out_en)) {
		p_x_buf = &(peddsa_adapter->kA_point[0][0]);
		p_y_buf = &(peddsa_adapter->kA_point[1][0]);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_XO2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
		hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_YO2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);
	}

	// Set Step3, mode_self/func_sel
	val = 0x0;
	val |= ((EDDSA_MODE2 << EDDSA_SHIFT_MOD_SEL) | (EDDSA_FUN_DECP_ADDP_SUB_MOD << EDDSA_SHIFT_FUN_SEL));
	DBG_EDDSA_INFO("int_ctrl_val = 0x%x\r\n", val);
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CTRL_REG_OFFSET, val);

	// Set engine start
	hal_rtl_eddsa_set_word_value((uint32_t)peddsa_obj, EDDSA_ENG_CONF_INT_REG_OFFSET, EDDSA_BIT_ENG_START);

	// Check interrupt signal
	ret = hal_rtl_eddsa_polling_wait_done(peddsa_adapter);
	if (ret != SUCCESS) {
		goto hal_rtl_eddsa_sign_verify_end;
	}

	// Check Rx, Ry
	p_x_buf = &(peddsa_adapter->rcheck_point[0][0]);
	p_y_buf = &(peddsa_adapter->rcheck_point[1][0]);
	hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_XO1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_x_buf);
	hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_YO1_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_y_buf);

	// Check encode Ry -> yo2
	p_rcheck = &(peddsa_adapter->rcheck_enc[0]);
	hal_rtl_eddsa_seq_get_word_from_byte((uint32_t)peddsa_obj, EDDSA_ENG_YO2_P0_REG_OFFSET, POINT_AXIS_VAL_SIZE, p_rcheck);

	ret = hal_rtl_eddsa_verify_32(p_rcheck, sig_r);
	if (ret != SUCCESS) {
		ret = FAIL;
		__dbg_mem_dump(peddsa_adapter->isMemDump, p_rcheck, POINT_AXIS_VAL_SIZE, "dump p_rcheck");
		__dbg_mem_dump(peddsa_adapter->isMemDump, sig_r, POINT_AXIS_VAL_SIZE, "dump signature_r");
	} else {
		if (1 == (peddsa_adapter->point_recover_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->point_recover[0][0]), POINT_AXIS_VAL_SIZE, "dump hwdec_pbk_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->point_recover[1][0]), POINT_AXIS_VAL_SIZE, "dump hwdec_pbk_y");
		}
		if (1 == (peddsa_adapter->sB_write_out_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[0][0]), POINT_AXIS_VAL_SIZE, "dump sxB_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->sB_point[1][0]), POINT_AXIS_VAL_SIZE, "dump sxB_y");
		}
		if (1 == (peddsa_adapter->kA_write_out_en)) {
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->kA_point[0][0]), POINT_AXIS_VAL_SIZE, "dump kxA_x");
			__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->kA_point[1][0]), POINT_AXIS_VAL_SIZE, "dump kxA_y");
		}
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[0][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_x");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_point[1][0]), POINT_AXIS_VAL_SIZE, "dump rcheck_point_y");
		__dbg_mem_dump(peddsa_adapter->isMemDump, &(peddsa_adapter->rcheck_enc[0]), POINT_AXIS_VAL_SIZE, "dump rcheck_enc");
	}

hal_rtl_eddsa_sign_verify_end:
	return ret;
}
#endif


#endif  // end of "#if CONFIG_EDDSA_EN"

